---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoatGlossy
source: html/d0035bbf-ffbd-628a-bc69-e472eefe499b.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoatGlossy Property

The property labeled "Glossiness" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintTopcoatGlossy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".